In [ ]:
#  chapter-2 
#   topic 2.1
#USE Data2 and Data3 files to work

In [ ]:
# Import pandas
import pandas as pd

# Read 'Data2.csv' into a DataFrame: silver
silver = pd.read_csv('Data2.csv')

# Read 'Data3.csv' into a DataFrame: gold
gold = pd.read_csv('Data3.csv')

# Print the first five rows of gold
print(gold.head())

  Country  gold  silver        date
0   Qatar   200       0  2014-01-01
1  Turkey   400       1  2015-02-02
2   Dubai   600       2  2016-03-03
3  Europe   800       3  2017-04-04
4      UK     0       4  3017-05-05

In [ ]:
# Import pandas
import pandas as pd

# Create the list of file names: filenames
filenames = ['Data2.csv', 'Data3.csv']

# Create the list of three DataFrames: dataframes
dataframes = []
for i in filenames:
    dataframes.append(pd.read_csv(i))

# Print top 5 rows of 1st DataFrame in dataframes
print(dataframes[1].head())

  Country  gold  silver        date
0   Qatar   200       0  2014-01-01
1  Turkey   400       1  2015-02-02
2   Dubai   600       2  2016-03-03
3  Europe   800       3  2017-04-04
4      UK     0       4  3017-05-05

In [ ]:
# Import pandas
import pandas as pd

# Make a copy of gold: medals
medals = gold.copy()

# Create list of new column labels: new_labels
new_labels = ['NOC', 'Country', 'Gold','Date']

# Rename the columns of medals using new_labels
medals.columns = new_labels
print(medals)
# Add columns 'silver' & 'gold' to medals
medals['silver2'] = gold['silver']
medals['gold2'] = gold['gold']

# Print the head of medals
print(medals.head())

      NOC  Country  Gold        Date
0   Qatar      200     0  2014-01-01
1  Turkey      400     1  2015-02-02
2   Dubai      600     2  2016-03-03
3  Europe      800     3  2017-04-04
4      UK        0     4  3017-05-05
      NOC  Country  Gold        Date  silver2  gold2
0   Qatar      200     0  2014-01-01        0    200
1  Turkey      400     1  2015-02-02        1    400
2   Dubai      600     2  2016-03-03        2    600
3  Europe      800     3  2017-04-04        3    800
4      UK        0     4  3017-05-05        4      0

In [ ]:
# Import pandas
import pandas as pd

# Read 'Data3.csv' into a DataFrame: weather1
file1 = pd.read_csv('Data3.csv', index_col='Country')

# Print the head of file1
print(file1.head())

# Sort the index of file1 in alphabetical order: file2
file2 = file1.sort_index()

# Print the head of file2
print(file2.head())

# Sort the index of file1 in reverse alphabetical order: file3
file3 = file1.sort_index(ascending=False)

# Print the head of file3
print(file3.head())

# Sort file1 numerically using the values of 'gold': file4
file4 = file1.sort_values('gold')

# Print the head of file4
print(file4.head())

         gold  silver        date
Country
Qatar     200       0  2014-01-01
Turkey    400       1  2015-02-02
Dubai     600       2  2016-03-03
Europe    800       3  2017-04-04
UK          0       4  3017-05-05
         gold  silver        date
Country
Dubai     600       2  2016-03-03
Europe    800       3  2017-04-04
Qatar     200       0  2014-01-01
Turkey    400       1  2015-02-02
UK          0       4  3017-05-05
         gold  silver        date
Country
UK          0       4  3017-05-05
Turkey    400       1  2015-02-02
Qatar     200       0  2014-01-01
Europe    800       3  2017-04-04
Dubai     600       2  2016-03-03
         gold  silver        date
Country
UK          0       4  3017-05-05
Qatar     200       0  2014-01-01
Turkey    400       1  2015-02-02
Dubai     600       2  2016-03-03
Europe    800       3  2017-04-04

In [ ]:
file1

         gold  silver
Country
Qatar     200       0
Turkey    400       1
Dubai     600       2
Europe    800       3
UK          0       4

In [ ]:
# Import pandas
import pandas as pd
file1 = pd.read_csv('Data2.csv', index_col='Country')
# Print shape of common_names
print(file1.shape)

# Drop rows with null counts: common_names
file5 = file1.dropna()

# Print shape of new common_names
print(file5.shape)
file5

(11, 4)
(9, 4)

         cpc  drive_right Purchased   pop
Country
France    44         True        No  10.0
Spain     27        False       Yes  20.0
Germany   30         True        No  30.0
Spain     38        False        No  20.0
Germany   40         True       Yes  30.0
France    35        False       Yes  10.0
China     52         True        No  80.0
India     48         True       Yes  60.0
America   45         True        No  40.0

In [ ]:
# Import pandas
import pandas as pd
file6 = pd.read_csv('Data3.csv', index_col='Country')
file6

         gold  silver        date
Country
Qatar     200       0  2014-01-01
Turkey    400       1  2015-02-02
Dubai     600       2  2016-03-03
Europe    800       3  2017-04-04
UK          0       4  3017-05-05

In [ ]:
# Extract selected columns from file as new DataFrame: file7
file7 = file6[['gold', 'silver']]

# Convert file7 to file8
file8 = (file7 - 32) * 5/9

# Rename 'gold' in column names with 'silver': file8
file8.columns = file8.columns.str.replace('gold', 'silver')

# Print first 5 rows of file8
print(file8.head())

             silver     silver
Country
Qatar     93.333333 -17.777778
Turkey   204.444444 -17.222222
Dubai    315.555556 -16.666667
Europe   426.666667 -16.111111
UK       -17.777778 -15.555556

In [ ]:
import pandas as pd

# Read 'GDP.csv' into a DataFrame: gdp
gdp = pd.read_csv('Data3.csv', parse_dates=True, index_col='date')
gdp
# Slice all the gdp data from 2015 onward: post2015
post2015 = gdp.loc['2015':]

# Print the last 2 rows of post2015
print(post2015.tail(2))

# Resample post2015 by year, keeping last(): yearly
#yearly = post2015.resample('A').last()
#yearly=post2015['gold']
# Print yearly
#print(yearly)

# Compute percentage growth of yearly: yearly['growth']
#yearly['gold'] = yearly.pct_change() * 100

# Print yearly again
#print(yearly)

           Country  gold  silver
date
2017-04-04  Europe   800       3
3017-05-05      UK     0       4

In [ ]:
import pandas as pd

# Read 'sp500.csv' into a DataFrame: sp500
sp500 = pd.read_csv('Data3.csv', parse_dates=True, index_col='date')

# Subset 'Open' & 'Close' columns from sp500: dollars
dollars = sp500[['gold', 'silver']]

# Print the head of dollars
print(dollars.head())

            gold  silver
date
2014-01-01   200       0
2015-02-02   400       1
2016-03-03   600       2
2017-04-04   800       3
3017-05-05     0       4

In [ ]:
#  chapter-2 
#   topic 2.2
#USE Data2 and Data3 files to work

In [ ]:
# Import pandas
import pandas as pd

# Create the list of file names: filenames
data_2 = pd.read_csv('Data2.csv')
data_3 = pd.read_csv('Data3.csv')
print(data_2)
print(data_3)

     Country  cpc  drive_right Purchased   pop
0     France   44         True        No  10.0
1      Spain   27        False       Yes  20.0
2    Germany   30         True        No  30.0
3      Spain   38        False        No  20.0
4    Germany   40         True       Yes  30.0
5     France   35        False       Yes  10.0
6      China   52         True        No  80.0
7      India   48         True       Yes  60.0
8    America   45         True        No  40.0
9     Canada   12        False       Yes   NaN
10  Pakistan   10         True       Yes   NaN
  Country  gold  silver        date
0   Qatar   200       0  2014-01-01
1  Turkey   400       1  2015-02-02
2   Dubai   600       2  2016-03-03
3  Europe   800       3  2017-04-04
4      UK     0       4  3017-05-05

In [ ]:
# Extract the 'cpc' column from data-2
cpc_data = data_2['cpc']

# Extract the 'Units' column from mar: mar_units
gold_data = data_3['gold']

# Append feb_units and then mar_units to jan_units: quarter1
quarter1 = cpc_data.append(gold_data)

# Compute & print total sales in quarter1
print(quarter1.sum())
quarter1

2381

0      44
1      27
2      30
3      38
4      40
5      35
6      52
7      48
8      45
9      12
10     10
0     200
1     400
2     600
3     800
4       0
dtype: int64

In [ ]:
# Initialize empty list: units
units = []

# Build the list of Series
for i in [cpc_data, gold_data]:
    units.append(i)
#print(units)
# Concatenate the list: quarter1
quarter1 = pd.concat(units, axis='rows')
print(quarter1)
quarter2 = pd.concat(units, axis='columns')
print(quarter2)

0      44
1      27
2      30
3      38
4      40
5      35
6      52
7      48
8      45
9      12
10     10
0     200
1     400
2     600
3     800
4       0
dtype: int64
    cpc   gold
0    44  200.0
1    27  400.0
2    30  600.0
3    38  800.0
4    40    0.0
5    35    NaN
6    52    NaN
7    48    NaN
8    45    NaN
9    12    NaN
10   10    NaN

In [ ]:
data_2

     Country  cpc  drive_right Purchased   pop
0     France   44         True        No  10.0
1      Spain   27        False       Yes  20.0
2    Germany   30         True        No  30.0
3      Spain   38        False        No  20.0
4    Germany   40         True       Yes  30.0
5     France   35        False       Yes  10.0
6      China   52         True        No  80.0
7      India   48         True       Yes  60.0
8    America   45         True        No  40.0
9     Canada   12        False       Yes   NaN
10  Pakistan   10         True       Yes   NaN

In [ ]:
# Add 'year' column to data_2 and data_3
data_2['year1'] = data_3['gold']
data_2['year2'] = data_3['silver']
data_2
# Append names_1981 after names_1881 with ignore_index=True: combined_names
combined_names = data_2.append(data_3, ignore_index=True)
combined_names

     Country   cpc drive_right Purchased  ...  year2   gold  silver        date
0     France  44.0        True        No  ...    0.0    NaN     NaN         NaN
1      Spain  27.0       False       Yes  ...    1.0    NaN     NaN         NaN
2    Germany  30.0        True        No  ...    2.0    NaN     NaN         NaN
3      Spain  38.0       False        No  ...    3.0    NaN     NaN         NaN
4    Germany  40.0        True       Yes  ...    4.0    NaN     NaN         NaN
5     France  35.0       False       Yes  ...    NaN    NaN     NaN         NaN
6      China  52.0        True        No  ...    NaN    NaN     NaN         NaN
7      India  48.0        True       Yes  ...    NaN    NaN     NaN         NaN
8    America  45.0        True        No  ...    NaN    NaN     NaN         NaN
9     Canada  12.0       False       Yes  ...    NaN    NaN     NaN         NaN
10  Pakistan  10.0        True       Yes  ...    NaN    NaN     NaN         NaN
11     Qatar   NaN         NaN       NaN  ...    NaN  200.0     0.0  2014-01-01
12    Turkey   NaN         NaN       NaN  ...    NaN  400.0     1.0  2015-02-02
13     Dubai   NaN         NaN       NaN  ...    NaN  600.0     2.0  2016-03-03
14    Europe   NaN         NaN       NaN  ...    NaN  800.0     3.0  2017-04-04
15        UK   NaN         NaN       NaN  ...    NaN    0.0     4.0  3017-05-05

[16 rows x 10 columns]

In [ ]:
# Sort the entries of cpc:
cpc_sorted = data_2.sort_index(level=0)
print(cpc_sorted)
# Print the number for china and india
print(cpc_sorted.iloc[2:4,:])

# Print data about silver medals
print(cpc_sorted.iloc[4])

     Country  cpc  drive_right Purchased   pop  year1  year2
0     France   44         True        No  10.0  200.0    0.0
1      Spain   27        False       Yes  20.0  400.0    1.0
2    Germany   30         True        No  30.0  600.0    2.0
3      Spain   38        False        No  20.0  800.0    3.0
4    Germany   40         True       Yes  30.0    0.0    4.0
5     France   35        False       Yes  10.0    NaN    NaN
6      China   52         True        No  80.0    NaN    NaN
7      India   48         True       Yes  60.0    NaN    NaN
8    America   45         True        No  40.0    NaN    NaN
9     Canada   12        False       Yes   NaN    NaN    NaN
10  Pakistan   10         True       Yes   NaN    NaN    NaN
   Country  cpc  drive_right Purchased   pop  year1  year2
2  Germany   30         True        No  30.0  600.0    2.0
3    Spain   38        False        No  20.0  800.0    3.0
Country        Germany
cpc                 40
drive_right       True
Purchased          Yes
pop                 30
year1                0
year2                4
Name: 4, dtype: object

In [ ]:
# Make the list of tuples: month_list
month_list = [('january', jan), ('february', feb), ('march', mar)]

# Create an empty dictionary: month_dict
month_dict = {}

for month_name, month_data in month_list:

    # Group month_data: month_dict[month_name]
    month_dict[month_name] = month_data.groupby('Company').sum()

# Concatenate data in month_dict: sales
sales = pd.concat(month_dict)

# Print sales
print(sales)

In [ ]:
#  chapter-2 
#   topic 2.3: You'll explore different techniques for merging, 
# and learn about left joins, right joins, inner joins, and outer joins, 
# as well as when to use which.
#USE Book1 and Book2 files to work

In [15]:
# Create the list of file names: filenames
import pandas as pd

revenue = pd.read_csv('Book1.csv')
managers = pd.read_csv('Book2.csv')
print(revenue)
print(managers)

     city  revenue  branch_id
0  austin      100         10
1  denver       83         20
2  spring        4         30
3  mexico      200         47
     city managers  branch_id
0  austin      tom         10
1  denver      jon         20
2  mexico  charles         47
3  spring    jassy         31

In [17]:
managers['branch']=managers['city']
managers

     city managers  branch_id  branch
0  austin      tom         10  austin
1  denver      jon         20  denver
2  mexico  charles         47  mexico
3  spring    jassy         31  spring

In [14]:
# Merge revenue with managers on 'city': merge_by_city
merge_by_city = pd.merge(revenue, managers, on='city')

# Print merge_by_city
print(merge_by_city)

# Merge revenue with managers on 'branch_id': merge_by_id
merge_by_id = pd.merge(revenue, managers, on='branch_id')

# Print merge_by_id
print(merge_by_id)

     city  revenue  branch_id_x state_x managers  branch_id_y state_y
0  austin      100           10      TX      tom           10      TX
1  denver       83           20      CO      jon           20      CO
2  spring        4           30      IL    jassy           31      MO
3  mexico      200           47      CA  charles           47      CA
   city_x  revenue  branch_id state_x  city_y managers state_y
0  austin      100         10      TX  austin      tom      TX
1  denver       83         20      CO  denver      jon      CO
2  mexico      200         47      CA  mexico  charles      CA

In [18]:
# Merge revenue & managers on 'city' & 'branch': combined
combined = pd.merge(revenue, managers, left_on='city', right_on='branch')

# Print combined
print(combined)

   city_x  revenue  branch_id_x  city_y managers  branch_id_y  branch
0  austin      100           10  austin      tom           10  austin
1  denver       83           20  denver      jon           20  denver
2  spring        4           30  spring    jassy           31  spring
3  mexico      200           47  mexico  charles           47  mexico

In [19]:
# Add 'state' column to revenue: revenue['state']
revenue['state'] = ['TX','CO','IL','CA']

# Add 'state' column to managers: managers['state']
managers['state'] = ['TX','CO','CA','MO']

# Merge revenue & managers on 'branch_id', 'city', & 'state': combined
combined = pd.merge(revenue, managers, on=['branch_id', 'city', 'state'])

# Print combined
print(combined)

     city  revenue  branch_id state managers  branch
0  austin      100         10    TX      tom  austin
1  denver       83         20    CO      jon  denver
2  mexico      200         47    CA  charles  mexico

In [23]:
# Merge revenue and sales: revenue_and_sales
revenue_and_sales = pd.merge(revenue, managers, how='right', on=['city', 'state'])

# Print revenue_and_sales
print(revenue_and_sales)

# Merge sales and managers: sales_and_managers
sales_and_managers = pd.merge(managers, revenue, how='left', left_on=['city'], right_on=['state'])

# Print sales_and_managers
print(sales_and_managers)

     city  revenue  branch_id_x state managers  branch_id_y  branch
0  austin    100.0         10.0    TX      tom           10  austin
1  denver     83.0         20.0    CO      jon           20  denver
2  mexico    200.0         47.0    CA  charles           47  mexico
3  spring      NaN          NaN    MO    jassy           31  spring
   city_x managers  branch_id_x  branch  ... city_y revenue  branch_id_y  state_y
0  austin      tom           10  austin  ...    NaN     NaN          NaN      NaN
1  denver      jon           20  denver  ...    NaN     NaN          NaN      NaN
2  mexico  charles           47  mexico  ...    NaN     NaN          NaN      NaN
3  spring    jassy           31  spring  ...    NaN     NaN          NaN      NaN

[4 rows x 9 columns]

In [25]:
print(revenue)
print(managers)

     city  revenue  branch_id state
0  austin      100         10    TX
1  denver       83         20    CO
2  spring        4         30    IL
3  mexico      200         47    CA
     city managers  branch_id  branch state
0  austin      tom         10  austin    TX
1  denver      jon         20  denver    CO
2  mexico  charles         47  mexico    CA
3  spring    jassy         31  spring    MO

In [24]:
# Merge revenue & managers on 'branch_id', 'city', & 'state': combined
combined_outer = pd.merge(revenue, managers, on=['city', 'state'], how='outer')
#merge_outer_on = pd.merge(sales_and_managers, revenue_and_sales, on=['city', 'state'], how='outer')
# Print combined
print(combined_outer)

     city  revenue  branch_id_x state managers  branch_id_y  branch
0  austin    100.0         10.0    TX      tom         10.0  austin
1  denver     83.0         20.0    CO      jon         20.0  denver
2  spring      4.0         30.0    IL      NaN          NaN     NaN
3  mexico    200.0         47.0    CA  charles         47.0  mexico
4  spring      NaN          NaN    MO    jassy         31.0  spring

In [33]:
print(revenue)
print(managers)

     city  revenue  branch_id state
0  austin      100         10    TX
1  denver       83         20    CO
2  spring        4         30    IL
3  mexico      200         47    CA
     city managers  branch_id  branch state
0  austin      tom         10  austin    TX
1  denver      jon         20  denver    CO
2  mexico  charles         47  mexico    CA
3  spring    jassy         31  spring    MO

In [26]:
# Perform the first ordered merge: tx_weather
tx_order = pd.merge_ordered(revenue, managers)

# Print tx_weather
print(tx_order)

     city  revenue  branch_id state managers  branch
0  austin    100.0         10    TX      tom  austin
1  denver     83.0         20    CO      jon  denver
2  mexico    200.0         47    CA  charles  mexico
3  spring      4.0         30    IL      NaN     NaN
4  spring      NaN         31    MO    jassy  spring

In [34]:
# Merge revenue and managers
merged = pd.merge_asof(revenue, managers, left_on='branch_id', right_on='state')

# Print the tail of merged
print(merged.tail())

MergeError: ignored